Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/io_qspi.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : IO_QSPI
// Version        : 1
// Bus type       : apb
// =============================================================================
#ifndef _HARDWARE_REGS_IO_QSPI_H
#define _HARDWARE_REGS_IO_QSPI_H
// =============================================================================
// Register    : IO_QSPI_USBPHY_DP_STATUS
#define IO_QSPI_USBPHY_DP_STATUS_OFFSET _u(0x00000000)
#define IO_QSPI_USBPHY_DP_STATUS_BITS   _u(0x04022200)
#define IO_QSPI_USBPHY_DP_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_QSPI_USBPHY_DP_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_MSB    _u(17)
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_LSB    _u(17)
#define IO_QSPI_USBPHY_DP_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_MSB    _u(13)
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_LSB    _u(13)
#define IO_QSPI_USBPHY_DP_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_QSPI_USBPHY_DP_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_QSPI_USBPHY_DP_CTRL
#define IO_QSPI_USBPHY_DP_CTRL_OFFSET _u(0x00000004)
#define IO_QSPI_USBPHY_DP_CTRL_BITS   _u(0x3003f01f)
#define IO_QSPI_USBPHY_DP_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_MSB    _u(29)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_LSB    _u(28)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DP_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_MSB    _u(17)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_LSB    _u(16)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DP_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_MSB    _u(15)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_LSB    _u(14)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_QSPI_USBPHY_DP_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_MSB    _u(13)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_LSB    _u(12)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DP_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DP_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x02 -> uart1_tx
//               0x03 -> i2c0_sda
//               0x05 -> siob_proc_56
//               0x1f -> null
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_MSB    _u(4)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_LSB    _u(0)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_UART1_TX _u(0x02)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_I2C0_SDA _u(0x03)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_SIOB_PROC_56 _u(0x05)
#define IO_QSPI_USBPHY_DP_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_QSPI_USBPHY_DM_STATUS
#define IO_QSPI_USBPHY_DM_STATUS_OFFSET _u(0x00000008)
#define IO_QSPI_USBPHY_DM_STATUS_BITS   _u(0x04022200)
#define IO_QSPI_USBPHY_DM_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_QSPI_USBPHY_DM_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_MSB    _u(17)
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_LSB    _u(17)
#define IO_QSPI_USBPHY_DM_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_MSB    _u(13)
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_LSB    _u(13)
#define IO_QSPI_USBPHY_DM_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_QSPI_USBPHY_DM_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_QSPI_USBPHY_DM_CTRL
#define IO_QSPI_USBPHY_DM_CTRL_OFFSET _u(0x0000000c)
#define IO_QSPI_USBPHY_DM_CTRL_BITS   _u(0x3003f01f)
#define IO_QSPI_USBPHY_DM_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_MSB    _u(29)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_LSB    _u(28)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DM_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_MSB    _u(17)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_LSB    _u(16)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DM_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_MSB    _u(15)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_LSB    _u(14)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_QSPI_USBPHY_DM_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_MSB    _u(13)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_LSB    _u(12)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_USBPHY_DM_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_USBPHY_DM_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x02 -> uart1_rx
//               0x03 -> i2c0_scl
//               0x05 -> siob_proc_57
//               0x1f -> null
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_MSB    _u(4)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_LSB    _u(0)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_UART1_RX _u(0x02)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_I2C0_SCL _u(0x03)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_SIOB_PROC_57 _u(0x05)
#define IO_QSPI_USBPHY_DM_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_QSPI_GPIO_QSPI_SCLK_STATUS
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OFFSET _u(0x00000010)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_BITS   _u(0x04022200)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_MSB    _u(17)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_LSB    _u(17)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_MSB    _u(13)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_LSB    _u(13)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_LSB    _u(9)
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_ACCESS "RO"
// =============================================================================
// Register    : IO_QSPI_GPIO_QSPI_SCLK_CTRL
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OFFSET _u(0x00000014)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_BITS   _u(0x3003f01f)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_RESET  _u(0x0000001f)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER
//               0x0 -> don't invert the interrupt
//               0x1 -> invert the interrupt
//               0x2 -> drive interrupt low
//               0x3 -> drive interrupt high
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_BITS   _u(0x30000000)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_MSB    _u(29)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_LSB    _u(28)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER
//               0x0 -> don't invert the peri input
//               0x1 -> invert the peri input
//               0x2 -> drive peri input low
//               0x3 -> drive peri input high
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_BITS   _u(0x00030000)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_MSB    _u(17)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_LSB    _u(16)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER
//               0x0 -> drive output enable from peripheral signal selected by funcsel
//               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
//               0x2 -> disable output
//               0x3 -> enable output
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_BITS   _u(0x0000c000)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_MSB    _u(15)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_LSB    _u(14)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_DISABLE _u(0x2)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_VALUE_ENABLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER
//               0x0 -> drive output from peripheral signal selected by funcsel
//               0x1 -> drive output from inverse of peripheral signal selected by funcsel
//               0x2 -> drive output low
//               0x3 -> drive output high
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_BITS   _u(0x00003000)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_MSB    _u(13)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_LSB    _u(12)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_NORMAL _u(0x0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_INVERT _u(0x1)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_LOW _u(0x2)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_VALUE_HIGH _u(0x3)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL
// Description : 0-31 -> selects pin function according to the gpio table
//               31 == NULL
//               0x00 -> xip_sclk
//               0x02 -> uart1_cts
//               0x03 -> i2c1_sda
//               0x05 -> siob_proc_58
//               0x0b -> uart1_tx
//               0x1f -> null
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_RESET  _u(0x1f)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_BITS   _u(0x0000001f)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_MSB    _u(4)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_LSB    _u(0)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_ACCESS "RW"
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_XIP_SCLK _u(0x00)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_UART1_CTS _u(0x02)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_I2C1_SDA _u(0x03)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_SIOB_PROC_58 _u(0x05)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_UART1_TX _u(0x0b)
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_VALUE_NULL _u(0x1f)
// =============================================================================
// Register    : IO_QSPI_GPIO_QSPI_SS_STATUS
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OFFSET _u(0x00000018)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_BITS   _u(0x04022200)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC
// Description : interrupt to processors, after override is applied
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_BITS   _u(0x04000000)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_MSB    _u(26)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_LSB    _u(26)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD
// Description : input signal from pad, before filtering and override are
//               applied
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_BITS   _u(0x00020000)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_MSB    _u(17)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_LSB    _u(17)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD
// Description : output enable to pad after register override is applied
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_BITS   _u(0x00002000)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_MSB    _u(13)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_LSB    _u(13)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD
// Description : output signal to pad after register override is applied
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_RESET  _u(0x0)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_BITS   _u(0x00000200)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_MSB    _u(9)
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_LSB    _u(9)
